app/Controllers/MainController.php

SELECT *
FROM `user_setting`
WHERE `user_id` = '2'
 LIMIT 1
SELECT *
FROM `bond`
WHERE `user_id` = '2'
AND `state` = 1
---
    public function show_bond_list()
    {
        $session = \Config\Services::session();

        $username = $session->get('username');

        if (!isset($username)) {
            return redirect()->to('/public/auth-login');
        }

        $data = [
            'title_meta' => view('partials/title-meta', ['title' => 'Lista de bonos']),
            'page_title' => view('partials/page-title', ['title' => 'Lista de bonos', 'pagetitle' => 'Lista de bonos']),
        ];

        $bondModel = new BondModel();
        $userSettingModel = new UserSettingModel();

        $userSettings = $userSettingModel->where('user_id', $session->get('id'))->first();

        $data['userSettings'] = $userSettings;

        $bonds = $bondModel->where('user_id', $session->get('id'))
            ->where('state', 1);

SELECT *
FROM `bond`
WHERE `user_id` = '2'
AND `state` = 1
AND  `code` LIKE '%BND-537EBE%' ESCAPE '!'
 LIMIT 1
---
    public function show_cash_flow_list()
    {
        $session = \Config\Services::session();
        $username = $session->get('username');
        if (!isset($username)) {
            return redirect()->to('/public/auth-login');
        }

        $data = [
            'title_meta' => view('partials/title-meta', ['title' => 'Flujo de caja']),
            'page_title' => view('partials/page-title', ['title' => 'Flujo de caja', 'pagetitle' => 'Flujo de caja']),
        ];

        $bondModel = new BondModel();

        $bond = $bondModel->where('user_id', $session->get('id'))
            ->where('state', 1);

        $code = $this->request->getGet('code');
        $name = $this->request->getGet('name');

        if ($code) {
            $bond->like('code', $code);
        }

        if ($name) {
            $bond->like('name', $name);
        }

        $bond = $bond->first();