app/Controllers/UserController.php

SELECT *
FROM `user`
WHERE `username` = 'alexandra.ramirez'
 LIMIT 1
SELECT *
FROM `user_setting`
WHERE `user_id` = '2'
 LIMIT 1
---
    public function show_user_settings()
    {
        $session = \Config\Services::session();

        $username = $session->get('username');
        if (!isset($username)) {
            return redirect()->to('/public/auth-login');
        }

        $data = [
            'title_meta' => view('partials/title-meta', ['title' => 'Configuración']),
            'page_title' => view('partials/page-title', ['title' => 'Configuración', 'pagetitle' => 'Configuración']),
        ];

        $userModel = new UserModel();
        $userSettingModel = new UserSettingModel();

        $user = $userModel->where('username', $username)->first();

        $userSettings = $userSettingModel->where('user_id', $user['id'])->first();